{   
    "name": "Chuanqing Pu",
    "position": "PhD Candidate",
    "affiliation": "Shanghai Jiao Tong University",
    "google_scholar": "https://scholar.google.com/citations?hl=en&user=ghyZtxcAAAAJ",
    "blog": "https://bigdogmanluo.github.io/",
    "github (69 stars)": "https://github.com/BigdogManLuo/",
    "linkedin": "https://www.linkedin.com/in/chuanqing-pu-943673317/",
    "avatar": "assets/img/avatar.jpg",
    "intro": "I am currently a PhD candidate specializing in probabilistic forecasting and uncertainty-aware/data-driven optimization for power systems. I am also passionate about <b>data engineering</b>, especially skilled in time-series forecasting and optimization modeling. I also maintain a personal <b>Blog</b> and <b>GitHub repositories</b> where I share insights and projects in data science.",
    "email": "sashabanks@sjtu.edu.cn",
    "Research Interests": [
        "Learning-based Optimization",
        "Uncertainty-aware Optimization",
        "Time Series Forecasting (Renewable Energy, Electricity Price, Load)",
        "Decision-focused Learning on Predict-and-Optimize Pipeline"
    ],
    "Professional Skills": {
        "Exploratory Data Analysis": "Proficient in data processing and analysis using tools such as Pandas, Polars, and Xarray; experienced with statistical analysis techniques including correlation analysis, multicollinearity diagnostics, normality testing, and stationarity tests; strong data engineering skills covering data cleaning, preprocessing, feature extraction, and visualization.",
        "Machine Learning": "Experienced with mainstream machine learning libraries including Scikit-learn, XGBoost, and LightGBM; familiar with standard algorithms for classification, regression, and clustering; hands-on expertise in feature engineering, model selection, and hyperparameter tuning; winner (1st) of two world-class forecasting hackathon competitions.",
        "Deep Learning": "Proficient with the PyTorch framework; capable of building and training neural network models; familiar with the application of CNNs, RNNs, and Transformers to time-series forecasting tasks.",
        "Optimization Modeling": "Primarily uses the CVXPY framework for optimization modeling; familiar with linear programming, mixed-integer programming, second-order cone relaxations, heuristic methods, and ADMM; experienced with solvers including Gurobi, MOSEK, COPT, and SCIP; capable of formulating real-world problems as mathematical optimization models and solving them efficiently.",
        "Version Control & Collaboration": "Proficient with Git-based version control systems; experienced in collaborative software development, efficient codebase management, and team-oriented workflows."
    },
    "Education": [
            {
                "degree": "Ph.D. in Electrical Engineering",
                "institution": "Shanghai Jiao Tong University",
                "year": "2023 - Present"
            },
            {
                "degree": "B.E. in Electrical Engineering",
                "institution": "Sichuan University",
                "year": "2019 - 2023"
            }
        ],

    "Research Experience": [
        {
            "topic": "LLM4 Energy Forecasting & Optimization",
            "subtopic":[
                {
                "topic": "Zero-shot Renewable Energy Forecasting through Vision-Language Models",
                "highlights": {
                    "motivation": "A fundamental limitation of statistical learning–based renewable energy forecasting methods is their strong reliance on site-specific historical data for end-to-end customized training. Newly commissioned renewable energy plants often lack sufficient operational data, making reliable forecasting infeasible.",
                    "approach": "We formulate cold-start forecasting for newly deployed renewable energy plants as a vision-driven zero-shot trajectory prediction problem, and propose a vision–language model (VLM)–based retrieval-augmented framework. Semantic representations are leveraged as a bridge for cross-domain generalization, and future power trajectories are estimated via local conditional expectation in the learned representation space."
                },
                "start_date":"2025-12",
                "end_date":"Present"
            },
            {
                "topic": "LLM-based Frameworks for Power Engineering from Routine to Novel Tasks",
                "highlights":{
                    "approach":"Develop LLM-oriented pipelines that support routine-to-novel engineering tasks (e.g., problem specification, reasoning, and assistance across heterogeneous data/knowledge sources) for more generalizable and human-in-the-loop forecasting/analysis."
                },
                "start_date":"2023-03",
                "end_date":"2023-10"
            }
        ],
            "publications": [
                    "Chuanqing Pu, Feilong Fan, Nengling Tai. \"Zero-shot Renewable Energy Nowcasting via Vision–Language Models.\" Under Preparation.",
                    "Ran Li, Chuanqing Pu, Junyi Tao, Canbing Li, Feilong Fan, Yue Xiang, Sijie Chen. \"LLM-based frameworks for power engineering from routine to novel tasks.\" arXiv preprint arXiv:2305.11202 (2023) (Methodology, Experiments, Writing)."
                ]
        },
        {
            "topic": "Decision-Focused Learning for Predict-and-Optimize in Power Systems",
            "subtopic":[
                {
                "topic": "Decision-Focused Continual Learning for Seaport Power-Logistics Scheduling under Varying Tasks Stream",
                "highlights":{
                    "motivation":"Decision-focused learning aligns the training of forecasting models with downstream decision outcomes. However, this end-to-end design inherently restricts the value of forecasting models to only a specific task structure, and thus generalize poorly to evolving tasks.",
                    "approach":"We address this gap with a decision-focused continual learning framework that adapts online to a stream of scheduling tasks. Specifically, we introduce Fisher information based regularization to enhance cross-task generalization by preserving parameters critical to prior tasks. A differentiable convex surrogate is also developed to stabilize gradient backpropagation. The proposed approach enables learning a decision-aligned forecasting model across a varying tasks stream with a sustainable long-term computational burden."
                },
                "start_date":"2024-12",
                "end_date":"Present"
            },
                {
                "topic": "Value-orineted Renewable Energy Forecasting towards Stability-Constrained Operation of Power Plants with Energy Storages",
                "highlights": {
                "motivation": "Conventional renewable energy power forecasting methods primarily focus on minimizing statistical prediction errors, while largely neglecting the impact of forecast inaccuracies on power system stability and economic operation.",
                "approach": "We propose a renewable energy power forecasting framework tailored for stability-constrained operation by embedding power system stability models into the forecasting loss function. This formulation explicitly quantifies the impact of forecast errors on deliverable transmission power, and an implicit differentiation–based training algorithm is developed to enable end-to-end backpropagation."
                },
                "start_date":"2023-09",
                "end_date":"2024-03"
            }
        ],

            "publications": [
                    "Chuanqing Pu, Feilong Fan, Nengling Tai, Yan Xu, Wentao Huang, Honglin Wen. \"Predict-then-Optimize for Seaport Power-Logistics Scheduling: Generalization across Varying Tasks Stream.\" IEEE Transactions on Smart Grid, Reviewing.",
                    "Feilong Fan, Chuanqing Pu, Jun Wang, Nengling Tai, Hongqiao Peng, Qifen Li. \"Transmission Power-oriented Forecasting towards Stability-Constrained Operation of Renewable Energy Power Plants with Energy Storages.\" CSEE Journal of Power and Energy Systems, 2025. (Supervisor as first author, my contribution include Conceptualization, Methodology, Experiments, Writing).",
                    "Jinming Yu, Chuanqing Pu, Zhenlan Dou, Chunyan Zhang, Jianfeng Li, Feilong Fan. \"End-to-End Forecasting Towards Economic Operation of Microgrid Using Derivative-Free Learning.\" IEEE Sustainable Power and Energy Conference (iSPEC) 2024.",
                    "ZHenlan Dou, Chunyan Zhang, Chuanqing Pu, Kunqi Jia, Zhonghao Li, Zihan Zhou. \"Achieving Optimal Demand-Side Integrated Energy Management via Hierarchical End-to-End Learning with Multisource NWP Data.\" Journal of Energy Engineering, 2026."
                ]
        },
        {
            "topic": "Learnign to Optimize Seport Energy-Logistics Scheduling",
            "highlights":{
                "motivation":"The energy–logistics co-optimization problem in seaports can be modeled as a large-scale mixed-integer programming problem. However, existing commercial solvers exhibit notable limitations in terms of computational efficiency and scalability, and the repeated day-to-day re-optimization from scratch results in considerable computational overhead.",
                "approach":"We propose a learning-augmented optimization framework that combines distributed optimization via ADMM with machine learning-based warm starts. A neural network is trained to predict high-quality initial solutions based on historical data, significantly accelerating convergence while preserving optimality."
            },
            "start_date":"2024-06",
            "end_date":"2024-12",
            "publications": [
                    "Feilong Fan, Chuanqing Pu, Nengling Tai, Jiayi Luo, Zhanpeng Chen, Xipeng Zhang. \"Distributed Stochastic Operation of Low-Carbon Port Energy-Logistics Systems via Learning to Warm-Start.\" IEEE Transactions on Industrial Applications, 2025. （导师一作,本人Conceptualization, Methodology, Experiments, Writing）", 
                    "Junlin Zhu, Feilong Fan, Chuanqing Pu, Nengling Tai, Wentao Huang, Canbing Li. \"Multi-Task Trustworthy Learning for Optimal Scheduling of Port Energy-Logistics Integrated Microgrids.\" IEEE Transactions on Industry Applications, 2025. (Conceptualization,Methodology）"
                ]
        },
        {
            "topic": "Renewable Energy Forecasting and Trading",
            "highlights": {
            "motivation": "With the increasing penetration of renewable energy sources such as wind and solar power in modern power systems, accurate power forecasting and effective trading strategies have become critical for ensuring grid stability and economically efficient operation.",
            "approach": "In the IEEE HEFTCom2024 competition, I developed a hybrid wind–solar probabilistic forecasting and trading framework. The approach integrates multi-source numerical weather prediction (NWP) models through ensemble forecasting, followed by online post-processing using Quantile LASSO and a probability density aggregation scheme to enhance predictive accuracy. To address electricity price uncertainty, a stochastic trading strategy was designed for participation in the day-ahead electricity market, achieving substantial trading profits. In addition, the potential of end-to-end learning frameworks for further improving forecasting and trading performance was systematically investigated."
            },
            "start_date": "2023-12",
            "end_date": "2024-06",
            "publications": [
            "Chuanqing Pu, Feilong Fan, Nengling Tai, Songyuan Liu, Jinming Yu. \"A Hybrid Strategy for Probabilistic Forecasting and Trading of Aggregated Wind-Solar Power: Design and Analysis in HEFTCom2024.\" International Journal of Forecasting, 2025."
            ]
        }
    ],
    "Other Publications": [
        "Pu, Chuanqing, Yue Xiang, Feilong Fan, Jiafei Huan, Li Deng, and Junyong Liu. \"Flexible Coordination of Wind Generators and Energy Storages in Joint Energy and Frequency Regulation Market.\" In 2023 Panda Forum on Power and Energy (PandaFPE), pp. 1926-1931. IEEE, 2023. (Best Paper, Best Oral Presentation)",
        "Fan, Feilong, Jun Wang, Chuanqing Pu, Nengling Tai, Wentao Huang, and Su Wang. \"Stability Constrained Robust Operation of Networked Seaport Microgrids.\" IEEE Transactions on Industry Applications (2025).",
        "Chen, Genwu, Yiwei Wei, Chuanqing Pu, Feilong Fan, Nengling Tai, and Wentao Huang. \"Aerodynamic Noise-Based Fault Detection for Wind Turbine Blades: An Online Unsupervised Approach.\" In 2024 IEEE 2nd International Conference on Power Science and Technology (ICPST), pp. 988-992. IEEE, 2024."
    ],

    "Data Engineering Experience":[
        {
            "name": "IEEE Hybrid Energy Forecasting and Trading Competition (HEFTCom24)",
            "from_date": "2024-01",
            "to_date": "2024-06",
            "award": "Best Student Team (1st Place)",
            "description": "During the first year of my Ph.D., I participated in the IEEE HEFTCom24 competition, which focuses on developing efficient hybrid wind–solar power forecasting and trading strategies to address the volatility and uncertainty of renewable generation. Our team developed multiple approaches, including multi-source NWP stacking for probabilistic forecasting, Quantile-LASSO–based online post-processing, probability density aggregation, and a stochastic trading strategy under electricity price uncertainty. Ultimately, we achieved the lowest average pinball loss and the highest trading profit, earning the “Best Student Team (1st Place)” award. We were also invited to present our work at ISF 2024, and submitted a paper detailing our methodology to the International Journal of Forecasting.",
            "links": {
                "practical_code": "https://github.com/BigdogManLuo/HEFTcom24/tree/online",
                "research_code": "https://github.com/BigdogManLuo/HEFTcom24",
                "paper": "https://arxiv.org/abs/2505.10367"
            }
        },
        {
            "name": "THS Forecasting Hackathon 2025",
            "from_date": "2025-07",
            "to_date": "2025-07",
            "description": "I participated in the forecasting hackathon organized by the International Institute of Forecasters (IIF) at ISF 2025. This was an in-person, time-limited coding competition focused on forecasting quarterly inbound tourism arrivals to Hong Kong and Macao for 2023–2025. By applying time-series analysis and machine learning techniques, I achieved 1st place with the lowest MAE.",
            "award": "First Prize(1st Place)"
        },
        {
            "name": "Kaggle - Hull Tactical Market Prediction",
            "from_date": "2025-10",
            "to_date": "2025-12",
            "description": "This was a global quantitative trading competition with over 5,000 participants. Contestants were required to predict the daily excess returns of S&P 500 constituents and make position-scaling decisions to maximize the Sharpe ratio. I developed a solution that combines probabilistic forecasting with uncertainty-aware optimization: I estimated CVaR via dense quantile regression, and formulated a position optimization model by deriving the one-step loss of the scoring rule. In an offline, leakage-free walk-forward evaluation, my model achieved an average Sharpe ratio of 1.33 across all folds (variance 0.9), exceeding the 15% market Sharpe benchmark.",
            "award": "Ongoing",
            "links":{
                "code":"https://www.kaggle.com/code/sherlockbanks/hull-tac-submission/",
                "discussion":"www.kaggle.com/competitions/hull-tactical-market-prediction/discussion/664108"
            }
        },
        {
            "type":"Digital Signal Processing & Embedded Systems",
            "name":"“TI Cup” National Undergraduate Electronic Design Competition",
            "from_date":"2021-03",
            "to_date":"2021-11",
            "description":"During my junior year, I participated in the 2021 “TI Cup” National Undergraduate Electronic Design Contest and won the National First Prize. The competition required designing and implementing DSP-based control algorithms for a three-phase inverter and rectifier. I led the development of the algorithmic modules, including three-/single-phase PLL, PID and PR controllers, and dq/αβ coordinate transformations, and delivered the full engineering workflow—from algorithm design to PCB implementation and experimental validation.",
            "award":"National 1st Prize",
            "links": {
                "dsp_tools":"https://github.com/BigdogManLuo/DSPLibrary",
                "pcb_source":"https://github.com/SeanXLee/universal-pe-starterkit",
                "demo_video":"https://github.com/SeanXLee/universal-pe-starterkit"
            }
        },
        {
            "type":"Numerical Computing & Simulation",
            "name":"“PowerFlower”: A Mini-Software for Power Flow Calculations",
            "from_date":"2022-08",
            "to_date":"2022-08",
            "description":"During my junior year, I developed a mini software called PowerFlower for power flow calculations. The software was written in MATLAB scripts and used App Designer to create a graphical interface. PowerFlower supports various power flow calculation methods, including the Newton-Raphson method, PQ decomposition method, and batch power flow analysis. Users can easily input system data, run power flow calculations, and view results graphically.",
            "links": {
                "code":"https://github.com/BigdogManLuo/powerFlower/tree/main",
                "document":"https://github.com/BigdogManLuo/powerFlower/blob/main/doc/document.pdf"
            }
     }
    ],
    "Presentations": [
        {
            "title": "Enhancing the Export Capability of Renewable Energy Bases through Two-Stage Small Signal Stability-Constrained Optimal Dispatch",
            "event": "The 14th International Conference on Renewable Power Generation (RPG 2025)",
            "location": "Shanghai, China",
            "date": "2025-10-26"
        },
        {
            "title": "Data-Driven Operation of Seaport Energy-Logistics Systems",
            "event": "Academic Visiting",
            "location": "University of Liverpool, UK",
            "date":"2025-08-22",
            "invited by": "Prof. Lin Jiang"
        },
        {
            "title": "Data-Driven Operation of Seaport Energy-Logistics Systems",
            "event": "Academic Visiting",
            "location": "University College London, UK",
            "date":"2025-08-22",
            "invited by": "Dr. Akylas Stratigakos",
            "pdf": "assets/files/UKAV/Presentation-research.pdf",
            "photo": "assets/files/UKAV/ucl.jpg"
        },
        {
            "title": "End-To-End Forecasting Towards Economic Operation of Microgrid Using Derivative-Free Learning",
            "event": "IEEE Sustainable Power and Energy Conference (iSPEC) 2024",
            "location": "Kuching, Malaysia",
            "date": "2024-11-26"
        },
        {
            "title": "Aggregated Probabilistic Forecasting and Stochastic Trading Strategies for HEFTCom2024",
            "event": "Ørsted Science Talk",
            "location": "Online",
            "date": "2024-09-09",
            "invited by": "Orsted Energy"
        },
        {
            "title": "Decoupled Probabilistic Forecasting for Hybrid Power Plants and Stochastic Programming-Based Value-Oriented Trading Strategy",
            "type": "keynote",
            "image": "assets/img/ISF2024.png",
            "event": "International Symposium of Forecasting 2024 (ISF2024) [Keynote] ",
            "location": "Dijon, France",
            "date": "2024-06-30",
            "invited by": "Prof. Jethro Browell and International Institute of Forecasters (IIF)"
        },
        {
            "title": "Aerodynamic Noise-Based Fault Detection for Wind Turbine Blades: An Online Unsupervised Approach",
            "event": "International Conference on Power Science and Technology (ICPST) 2024",
            "location": "Yunnan, China",
            "date": "2024-05-10"
        },
        {
            "title": "Flexible Coordination of Wind Generators and Energy Storages in Joint Energy and Frequency Regulation Market",
            "event":"Panda Forum on Power and Energy (PandaFPE)",
            "location":"Chengdu, China",
            "date":"2023-04-28"
        }
    ],
    "Personal Interests": [
        "Guitar, piano (formerly a band keyboardist)",
        "Basketball, table tennis",
        "Open source software development (see my GitHub repository)"
    ]
}